app/controllers/employees_controller.rb

  def create
    # @employee = Employee.new(employee_params)
    @employee = current_user.employees.build(employee_params)

    respond_to do |format|
      if @employee.save
---
INSERT INTO "employees" ("first_name", "last_name", "employee_type", "email", "phone", "skype", "created_at", "updated_at", "user_id") VALUES (?, ?, ?, ?, ?, ?, ?, ?, ?)

  def update
    respond_to do |format|
      if @employee.update(employee_params)
---
UPDATE "employees" SET "last_name" = ?, "employee_type" = ?, "email" = ?, "phone" = ?, "skype" = ?, "updated_at" = ? WHERE "employees"."id" = ?  [["last_name", "potter"], ["employee_type", "Internship"], ["email", "test@gmail.com"], ["phone", "8889999888"], ["skype", "@testing"], ["updated_at", "2021-05-16 09:26:38.679921"], ["id", 22]]

  def correct_user
      @employee = current_user.employees.find_by(id: params[:id])
---
SELECT "employees".* FROM "employees" WHERE "employees"."user_id" = ? AND "employees"."id" = ? LIMIT ?  [["user_id", 5], ["id", 13], ["LIMIT", 1]]